// FileSyncUI Localizable.strings

// The name of the product
"FileSyncUI" = "File Sync";

// Text of "ok" button, used in various dialogs.
"OK" = "OK";

// Text of "cancel" button, used in various dialogs.
"CANCEL" = "Cancel";

// Text of "Next" button, used in various dialogs
"NEXT" = "Next";

// Text of "Done" button, used in various dialogs
"DONE" = "Done";

// Text of "Continue" button, used in various dialogs
"CONTINUE" = "Continue";


// ------------------------
// Exception (error) window

"DESTINATION:" = "Destination:";	// Destination label - prefixes the destination path of a symlink.
"MODIFIED:"    = "Modified:";		// Modified label - prefixes the displayed mod date
"NAME:"        = "Name:";			// Name label - prefixes the name of the file
"SIZE:"        = "Size:";			// Size label - prefixes the displayed size of the file
"IDISK"		   = "iDisk";			// Prefixing the path with "iDisk/" when appropriate

// These labels tell the user which side of the mirror the file which caused the error resides on
"THIS_COMPUTER" = "On This Computer";	// For iDisk
".MAC"          = "On %@";				// For iDisk
"LOCAL_MHD"     = "On This Computer";	// For Mobile Home Directories (MHD)
"REMOTE_MHD"    = "On The Network";		// For MHD

// To reveal the errored file in Finder when appropriate
"SHOW IN FINDER" = "Show in Finder";


// ------------------------
// Exception (error) dialog

// The title of the exception dialog.
"IDISK ERROR TITLE" = "iDisk Error";
"MHD ERROR TITLE"   = "Home Sync Error";
"FS ERROR TITLE"    = "File Sync Error";

// Error code. The argument is an integer number, such as -43.
"ERROR%" = "Error code is %d.";

// Exception count.
// The first argument is an integer index, the second is the total number of errors. E.g., "iDisk Error 1 of 5"
"IDISK ERROR COUNT%" = "iDisk Error %d of %d";
"MHD ERROR COUNT%"   = "Home Sync Error %d of %d";
"FS ERROR COUNT%"    = "File Sync Error %d of %d";

// Title text of the error. Two variations, only one is used at a time.
// The argument is a filename.
"ERROR DELETING%"      = "There is a problem deleting the file “%@”.";
"ERROR SYNCING%"       = "There is a problem syncing the file “%@”.";
"ERROR MOVING%"        = "There is a problem moving the file “%@”.";
"ERROR ACCESSING%"     = "There is a problem syncing the file “%@”.";
"DIR:ERROR DELETING%"  = "There is a problem deleting the folder “%@”.";
"DIR:ERROR SYNCING%"   = "There is a problem syncing the folder “%@”.";
"DIR:ERROR MOVING%"    = "There is a problem moving the folder “%@”.";
"DIR:ERROR ACCESSING%" = "There is a problem syncing the folder “%@”.";


// ------------------------
// Exception dialog error messages.
// The first string is a short description of the error.
// The second string is additional help text.

// dskFulErr
// The first three strings are variations of the short description: iDisk, mobile home, and general syncing.
"IDISK DSKFULERR"      = "Your iDisk is almost full. There isn′t enough space on your iDisk to sync this item.";
"MHD DSKFULERR"        = "Your home directory is almost full. There isn′t enough free space available to sync this item.";
"FS DSKFULERR"         = "Your disk is almost full. There isn′t enough free space available to sync this item.";
"IDISK DSKFULERR HELP" = "There are items on your iDisk that are in the Trash. To make more space available, empty the Trash.";

// afpAccessDenied
// The first two strings are variations of the short description: deleting, syncing
"AFPACCESSDENIED DELETE"     = "You do not have permission to delete this file.";
"AFPACCESSDENIED SYNC"       = "You do not have permission to sync this file.";
"DIR:AFPACCESSDENIED DELETE" = "You do not have permission to delete this folder.";
"DIR:AFPACCESSDENIED SYNC"   = "You do not have permission to sync this folder.";
"AFPACCESSDENIED HELP"       = "You can check your permissions in the Info panel in the Finder.";

// kSFFileNameDiffersByCase
// The first three strings are variations of the short description: iDisk, mobile home, general syncing.
"IDISK KSFFILENAMEDIFFERSBYCASE"     = "The name of this file is the same as the name of another item on your iDisk except for the capitalization of some letters.";
"MHD KSFFILENAMEDIFFERSBYCASE"       = "The name of this file is the same as the name of another item in your home directory except for the capitalization of some letters.";
"FS KSFFILENAMEDIFFERSBYCASE"        = "The name of this file is the same as the name of another item on your disk except for the capitalization of some letters.";
"DIR:IDISK KSFFILENAMEDIFFERSBYCASE" = "The name of this folder is the same as the name of another item on your iDisk except for the capitalization of some letters.";
"DIR:MHD KSFFILENAMEDIFFERSBYCASE"   = "The name of this folder is the same as the name of another item in your home directory except for the capitalization of some letters.";
"DIR:FS KSFFILENAMEDIFFERSBYCASE"    = "The name of this folder is the same as the name of another item on your disk except for the capitalization of some letters.";
"KSFFILENAMEDIFFERSBYCASE HELP"      = "You should change the name of this item so that it′s different in a more significant way. For example, add a number to the name.";

// fBsyErr
"FSBSYERR"      = "The file is in use.";
"FSBSYERR HELP" = "An application may have the file open. Try closing the file or quitting applications.";

// fLckdErr
"FLCKDERR"      = "The file is locked.";
"DIR:FLCKDERR"  = "The folder is locked.";
"FLCKDERR HELP" = "You can unlock the item using the Info panel in the Finder.";

"File Not Found"      = "The file was not found.";
"HELP:File Not Found" = "The file may have moved during syncing. Try syncing again.";

"File Name Too Long"      = "A file or folder name is too long.";
"HELP:File Name Too Long" = "Rename this item so that the name is shorter.";

"I/O Error"      = "An error occurred reading or writing the file.";
"HELP:I/O Error" = "Please try again later.";

"Destination does not support symlinks"      = "The destination does not support symlinks.";
"HELP:Destination does not support symlinks" = "Try compressing the file or folder first.";

"Object deleted"      = "The item was deleted before it could be synced.";
//"HELP:Object deleted" = "";

"Object created"      = "A new item was created in the same location as this item before it could be synced.";
//"HELP:Object created" = "";

"Object modified"     = "This item to be updated was modified by another application before it could be synced.";
//"HELP:Object modified" = "";

"Network error"       = "A network error has occurred.";
"HELP:Network error"  = "Check your network connection or try again later.";

//"Timeout Error"       = "The server has stopped responding.";

"Unknown error"            = "A problem occurred.";					// [rdar://5231555]
"HELP:Unknown error"       = "Please try again later.";
"HELP-IDISK:Unknown error" = "Please try again later.";
"HELP-PHD:Unknown error"   = "Please try again later. If this problem persists, contact your network administrator.";

"IDISK ALMOST FULL"     = "Your iDisk is almost full.";
"ALMOST FULL TRASH MSG" = "There are files on your iDisk that are in the Trash. To make more space available, empty the Trash.\n\nYou can increase the size of your iDisk by going to the %@ pane of System Preferences.";
"ALMOST FULL .MAC MSG"  = "You can increase the size of your iDisk by going to the %@ pane of System Preferences.";

"REVERIFICATION"      = "The file changed during each of the last %@ syncs.";
"REVERIFICATION HELP" = "An application may be periodically modifying the file. Try closing the file or quitting applications.";

"TOO_MANY_EAS"      = "The destination does not support some of the data contained in this item.";
"TOO_MANY_EAS HELP" = "Try compressing the file or folder first.";

// ---------------------
// offline folder dialog

"OFFLINE FOLDER%"    = "The %@ folder is only available when your iDisk is online.";
"OFFLINE FOLDER MSG" = "To access this folder you will need to connect your computer to the Internet.";


// Size formats, used in the conflict and exception dialog to show file sizes.
// The argument is the number of bytes, the suffixes are the abbreviations for the standard metric scales: kilobytes, megabytes, etc.
"%BYTES" = "%llu bytes";
"%KB"    = "%.2f KB";
"%MB"    = "%.2f MB";
"%GB"    = "%.2f GB";
"%TB"    = "%.2f TB";
"%PB"    = "%.2f PB";
"%XB"    = "%.2f XB";


// --------------------
// Conflict list window

// Conflict count. Singular and plural. The plural argument is an integer. Used in the conflict *list* window, not the conflict resolution window
"1CONFLICT"  = "1 conflict";
"%CONFLICTS" = "%d conflicts";


// -----------------------
// Conflict manager window

"%IS_OUT_OF_SYNC"          = "\"%@\" was modified in both locations.";			// Name of conflicting item.
"%WHERE"                   = "Where: %@";						// Path to parent folder of conflicting item.
"%CONFLICT_COUNT"          = "%d of %d";						// Conflict count (arguments are integers i.e., "1 of 16")
"ROOT"                     = "-root-";							// The name of the root of the sync point, rather than @"/"
"FILE"                     = "file";
"FOLDER"                   = "folder";
"PACKAGE"                  = "package";
"SYMLINK"                  = "symlink";
"IDISK_LOCAL_TITLE"        = "This Computer";
"IDISK_POPUP_LOCAL_TITLE"  = "Keep file on this computer";
"IDISK_POPUP_REMOTE_TITLE" = "Keep file on %@";
"MHD_LOCAL_TITLE"          = "On This Computer";
"MHD_REMOTE_TITLE"         = "On The Network";
"MHD_POPUP_LOCAL_TITLE"    = "Keep file on this computer";
"MHD_POPUP_REMOTE_TITLE"   = "Keep file on the network";
"1_IDISK_CONFLICT"         = "There is an iDisk sync conflict.";			// Singular for iDisk
"%_IDISK_CONFLICTS"        = "There are %d iDisk sync conflicts.";			// Plural for iDisk
"1_MHD_CONFLICT"           = "There is a home sync conflict.";				// Singular for MHD
"%_MHD_CONFLICTS"          = "There are %d home sync conflicts.";			// Plural for MHD
"IDISK_RESOLVE_REMOTE"     = "Resolve all conflicts using the files on %@";
"IDISK_RESOLVE_LOCAL"      = "Resolve all conflicts using the files on this computer";
"IDISK_RESOLVE_BOTH"       = "Resolve all conflicts by keeping both files";
"IDISK_RESOLVE_LASTMOD"    = "Resolve all conflicts by keeping the file with the most recent mod date.";
"IDISK_RESOLVE_EXCLUDE"    = "Resolve all conflicts by excluding the files from future syncs.";
"IDISK_RESOLVE_NONE"       = "Ignore all conflicts.";
"MHD_RESOLVE_REMOTE"       = "Resolve all conflicts using the files on the network";
"MHD_RESOLVE_LOCAL"        = "Resolve all conflicts using the files on this computer";
"MHD_RESOLVE_BOTH"         = "Resolve all conflicts by keeping both files";
"MHD_RESOLVE_LASTMOD"      = "Resolve all conflicts by keeping the file with the most recent mod date.";
"MHD_RESOLVE_EXCLUDE"      = "Resolve all conflicts by excluding the files from future syncs.";
"MHD_RESOLVE_NONE"         = "Ignore all conflicts.";
"MHD_CONFLICT_TITLE"       = "Sync Conflicts";

// Unable to resolve all conflicts alert sheet
"NOT_ALL_RESOLVED_TITLE" = "Unable to resolve all conflicts";
"NOT_ALL_RESOLVED_MSG"   = "Some conflicts could not be resolved because their modification dates are too close together. Please resolve these conflicts manually or by using a different option.";

"There are no file syncing errors or conflicts." = "There are no file syncing errors or conflicts.";

// -----------------
// Global Exceptions

// iDisk
"GLOBAL-IDISK:Timeout"      = "Your iDisk did not finish syncing. Please try again later.";
"GLOBAL-HELP-IDISK:Timeout" = "If you continue to have problems syncing your iDisk, your Internet connection might be experiencing problems. Try quitting other applications that use the Internet before you try again.";

"GLOBAL-IDISK:NetworkError"      = "Your iDisk did not finish syncing.";
"GLOBAL-HELP-IDISK:NetworkError" = "Check your network connection or try again later.";

"GLOBAL-IDISK:RemoteBusy"      = "Your iDisk did not finish syncing.";
"GLOBAL-HELP-IDISK:RemoteBusy" = "Please try again later.";

"GLOBAL-IDISK:UNKNOWN"      = "Your iDisk did not finish syncing because a problem occurred.";
"GLOBAL-HELP-IDISK:UNKNOWN" = "Please try again later.";

// PHD
"GLOBAL-PHD:Timeout"      = "Your home directory did not finish syncing. Please try again later.";
"GLOBAL-HELP-PHD:Timeout" = "If you continue to have problems syncing your home directory, your network connection might be experiencing problems. Try quitting other applications that use the network before you try again.";

"GLOBAL-PHD:NetworkError"      = "Your home directory did not finish syncing.";
"GLOBAL-HELP-PHD:NetworkError" = "Check your network connection or try again later.";

"GLOBAL-PHD:RemoteBusy"      = "Your home directory did not finish syncing.";
"GLOBAL-HELP-PHD:RemoteBusy" = "Please try again later.";

"GLOBAL-PHD:UNKNOWN"      = "Your home directory did not finish syncing because a problem occurred.";
"GLOBAL-HELP-PHD:UNKNOWN" = "Please try again later.";

// Other
"GLOBAL-FS:Timeout"      = "Your files did not finish syncing. Please try again later.";
"GLOBAL-HELP-FS:Timeout" = "If you continue to have problems syncing your files, your network connection might be experiencing problems. Try quitting other applications that use the network before you try again.";

"GLOBAL-FS:NetworkError"      = "Your files did not finish syncing.";
"GLOBAL-HELP-FS:NetworkError" = "Check your network connection or try again later.";

"GLOBAL-FS:RemoteBusy"      = "Your files did not finish syncing.";
"GLOBAL-HELP-FS:RemoteBusy" = "Please try again later.";

"GLOBAL-FS:UNKNOWN"      = "Your files did not finish syncing because a problem occurred.";
"GLOBAL-HELP-FS:UNKNOWN" = "Please try again later.";
